podonoghue/usbdm-eclipse-plugins/net.sourceforge.usbdm.peripherals.freescale/data/peripherals/USBHS_MK66F18.svd.xml
<!--
Devices using this peripheral: 
      MK26F18
      MK65F18
      MK66F18
-->
      <peripheral>
         <?sourceFile "USBHS_MK66F18" ?>
         <name>USBHS</name>
         <description>USB HS/FS/LS OTG Controller</description>
         <groupName>USBHS</groupName>
         <prependToName>USBHS_</prependToName>
         <headerStructName>USBHS</headerStructName>
         <baseAddress>0x400A1000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x204</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ID</name>
               <description>Identification Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <resetValue>0xE461FA05</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Configuration number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NID</name>
                     <description>no description available</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TAG</name>
                     <description>Tag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REVISION</name>
                     <description>Revision</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VERSION</name>
                     <description>Version</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>VERSIONID</name>
                     <description>Version ID</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWGENERAL</name>
               <description>General Hardware Parameters Register</description>
               <addressOffset>0x4</addressOffset>
               <access>read-only</access>
               <resetValue>0x15</resetValue>
               <fields>
                  <field>
                     <name>PHYW</name>
                     <description>PHY Width</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>01</name>
                           <description>16 bit wide data bus</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PHYM</name>
                     <description>PHY Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>Controller configured for UTMI/UTMI+ interface</description>
                           <value>0b000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SM</name>
                     <description>Serial mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>No Serial Engine, always use parallel signaling</description>
                           <value>0b00</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWHOST</name>
               <description>Host Hardware Parameters Register</description>
               <addressOffset>0x8</addressOffset>
               <access>read-only</access>
               <resetValue>0x10020001</resetValue>
               <fields>
                  <field>
                     <name>HC</name>
                     <description>Host Capable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NPORT</name>
                     <description>Number of Ports</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TTASY</name>
                     <description>Transaction translator contexts</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TTPER</name>
                     <description>Transaction translator periodic contexts</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWDEVICE</name>
               <description>Device Hardware Parameters Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <resetValue>0x9</resetValue>
               <fields>
                  <field>
                     <name>DC</name>
                     <description>Device Capable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DEVEP</name>
                     <description>Device endpoints</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWTXBUF</name>
               <description>Transmit Buffer Hardware Parameters Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <resetValue>0x80070908</resetValue>
               <fields>
                  <field>
                     <name>TXBURST</name>
                     <description>Transmit Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXADD</name>
                     <description>Transmit Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXCHANADD</name>
                     <description>Transmit Channel Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXLC</name>
                     <description>Transmit local Context</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Store device transmit contexts in the TX FIFO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Store device transmit contexts in a register file</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWRXBUF</name>
               <description>Receive Buffer Hardware Parameters Register</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <resetValue>0x808</resetValue>
               <fields>
                  <field>
                     <name>RXBURST</name>
                     <description>Receive Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXADD</name>
                     <description>Receive Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>GPTIMER%sLD</name>
               <description>General Purpose Timer n Load Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>GPTLD</name>
                     <description>no description available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>8</dimIncrement>
               <dimIndex>0,1</dimIndex>
               <name>GPTIMER%sCTL</name>
               <description>General Purpose Timer n Control Register</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>GPTCNT</name>
                     <description>Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Timer Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>One shot</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Repeat</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RST</name>
                     <description>Timer Reset</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No action</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Load counter value</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUN</name>
                     <description>Timer Run</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Timer stop</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Timer run</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USB_SBUSCFG</name>
               <description>System Bus Interface Configuration Register</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>BURSTMODE</name>
                     <description>Burst mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>INCR burst of unspecified length</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>INCR4, non-multiple transfers of INCR4 is decomposed into singles</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>INCR8, non-multiple transfers of INCR8, is decomposed into INCR4 or singles</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>INCR16, non-multiple transfers of INCR16, is decomposed into INCR8, INCR4 or singles</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>Reserved, do not use</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>INCR4, non-multiple transfers of INCR4 is decomposed into smaller unspecified length bursts</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>INCR8, non-multiple transfers of INCR8 is decomposed into smaller unspecified length bursts</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>INCR16, non-multiple transfers of INCR16 is decomposed into smaller unspecified length bursts</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCIVERSION</name>
               <description>Host Controller Interface Version and Capability Registers Length Register</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <resetValue>0x1000040</resetValue>
               <fields>
                  <field>
                     <name>CAPLENGTH</name>
                     <description>Capability registers length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>HCIVERSION</name>
                     <description>EHCI revision number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCSPARAMS</name>
               <description>Host Controller Structural Parameters Register</description>
               <addressOffset>0x104</addressOffset>
               <access>read-only</access>
               <resetValue>0x10011</resetValue>
               <fields>
                  <field>
                     <name>N_PORTS</name>
                     <description>Number of Ports</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PPC</name>
                     <description>Power Port Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Ports have power port switches</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>N_PCC</name>
                     <description>Number Ports per CC</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>N_CC</name>
                     <description>Number of Companion Controllers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PI</name>
                     <description>Port Indicators</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No port indicator fields</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The port status and control registers include a R/W field for controlling the state of the port indicator</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>N_PTT</name>
                     <description>Ports per Transaction Translator</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>N_TT</name>
                     <description>Number of Transaction Translators</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HCCPARAMS</name>
               <description>Host Controller Capability Parameters Register</description>
               <addressOffset>0x108</addressOffset>
               <access>read-only</access>
               <resetValue>0x6</resetValue>
               <fields>
                  <field>
                     <name>ADC</name>
                     <description>64-bit addressing capability</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFL</name>
                     <description>Programmable Frame List flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ASP</name>
                     <description>Asynchronous Schedule Park capability</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Park not supported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Park supported</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IST</name>
                     <description>Isochronous Scheduling Threshold</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The value of the least significant 3 bits indicates the number of microframes a host controller can hold a set of isochronous data structures (one or more) before flushing the state</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EECP</name>
                     <description>EHCI Extended Capabilities Pointer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No extended capabilities are implemented</description>
                           <value>0b0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
